let csvText = `48.30,32.16,Кропивницький,200000,
44.38,34.33,Алушта,31440,
49.46,30.17,Біла Церква,200131,
49.54,28.49,Бердичів,87575,#некоммент

#
46.49,36.58,#Бердянськ,121692,
49.15,28.41,Вінниця,356665,
#45.40,34.29,Джанкой,43343,

50.45,30.52,Київ,2804000,
49.83,24.02,Львів,721301,
48.92,24.71,Івано-Франківськ,230760,
46.48,30.73,Одеса,1001558,
49.56,25.59,Тернопіль,217350,
48.62,22.29,Ужгород,117317,
49.84,24.03,Дрогобич,68284,
50.75,25.35,Луцьк,216429,
48.45,22.72,Мукачево,82072,
50.11,25.79,Рівне,245930,
48.29,25.94,Чернівці,265122,
49.42,27.00,Хмельницький,267973,
50.85,28.66,Чернігів,296723,
48.45,35.04,Дніпро,1002243,
49.45,32.06,Черкаси,285697,
48.88,22.30,Лебедин,26166,
50.61,26.26,Житомир,270619,
46.97,32.00,Херсон,294183,
48.45,35.04,Запоріжжя,740964,
50.62,26.25,Коростень,63500,

# в цьому файлі три рядки-коментаря :)`;

let text = `У різноманітному мозаїчному пейзажі України виділяються чимало міст, що розташовані у різних куточках країни. З південного заходу варто відзначити прекрасне місто Одеса, в якому мандрувати по безкрайніх набережних – справжнє задоволення. На заході України розташувалася Львівська перлина, Львів, який вражає своєю архітектурною спадщиною та неповторною атмосферою. Недалеко від Львова можна знайти і Івано-Франківськ – місто, що поринає в історію своїх корінь.
Під східним сонцем вас вразить Одеса, місто на березі Чорного моря, яке завжди відкрите для гостей та дарує неповторні враження. У західній частині України можна відзначити Тернопіль та Житомир, що вражають своєю культурною спадщиною та атмосферою затишку.
На південному заході країни мальовничо розташовані міста Ужгород та Мукачево, які зберігають свою унікальну історію та традиції. Із півночі вирушайте до Луцька, міста, яке манить своєю давньою архітектурою та неповторною атмосферою.
По центральним шляхам України вас вразить Рівне, Чернівці, Хмельницький та Чернігів, кожне з яких має свої унікальні риси та чарівність.
В серці країни, великому Дніпрі, можна насолодитися красою міста та динамікою його розвитку. Також, варто відвідати Черкаси, де традиції і сучасність переплітаються в неповторний спосіб.
На південь вирушайте до Херсона, що розташований біля Чорного моря, де зустрінете унікальну природу та історичні пам'ятки. А на сході країни несамовито мальовниче Запоріжжя та Коростень, які вражають своєю величчю та розвинутістю.
Україна — країна, де кожне місто має свою історію та неповторність, чекаючи, щоб ви відкрили для себе всі їхні чари.`;

function parse(csvData){
    const topCities = csvData.split("\n")
    .filter((row) => !(row.includes("#") || row === ""))
    .map((row) => {
        const rowElements = row.split(",");
        return {
            x: + rowElements[0], // Parsing to number
            y: + rowElements[1],
            name: rowElements[2],
            population: + rowElements[3]
        }
    })
    .sort(((a, b) => (b.population || 0) - (a.population || 0)))
    .slice(0,10)
    .reduce((acc, city, index) => {
        acc[city.name] = {
            population: city.population,
            rating:index + 1
        };
        return acc;
    }, {});

    console.log(topCities);

    return (text) => {
        for (let cityName in topCities) {
            const city = topCities[cityName];
            text = text.replaceAll(cityName,`${cityName} (${city.rating} місце в ТОП-10 найбільших міст України, населення ${city.population} ${city.population % 10 === 1 ? "людина" : (city.population % 10 < 5 ? "людини" : "людей")})`);
        }
      return text;  
    }
}

let changeText = parse(csvText);
let beautifulText = changeText(text);

console.log(beautifulText);